openfoam2/OpenFOAM-2.3.x/tutorials/multiphase/interFoam/ras/damBreakPorousBaffle/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    rightWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    lowerWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    atmosphere
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
    porous_half0
    {
        type            porousBafflePressure;
        patchType       cyclic;
        jump            uniform 0;
        value           uniform 0;
        D               1000;
        I               1000;
        length          0.15;
    }
    porous_half1
    {
        type            porousBafflePressure;
        patchType       cyclic;
        value           uniform 0;
        D               1000;
        I               1000;
        length          0.15;
    }
}


// ************************************************************************* //
